<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Comparison Operators </h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Comparison operators in SQL are used to filter and retrieve specific data from a database based on specified conditions.<br>These operators enable you to compare values in columns with specified values or expressions.<br><br>The WHERE clause in SQL queries often incorporates these comparison operators to narrow down the result set according to certain criteria.</div>

In [1]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/csv_data

In [2]:
%sql SELECT * FROM data

 * mysql+pymysql://root:***@localhost:3307/csv_data
4 rows affected.

[(1, 'John', 45000),
 (2, 'Jane', 50000),
 (3, 'Bob', 55000),
 (4, 'Alice', 60000)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">= Equal To <ul>Extract Value if expression equal to condition<br>Filter the Value on Specfic Condition</ul></div>

In [3]:
%sql SELECT Name FROM data WHERE salary = 50000

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('Jane',)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">!= , <> Not Equal To<ul>Extract Value if expression not equal to condition<br>Filter the Value on Specfic Condition</ul></div>

In [5]:
%sql SELECT * FROM data WHERE salary != 50000

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(1, 'John', 45000), (3, 'Bob', 55000), (4, 'Alice', 60000)]

In [4]:
# <> same work as !=
%sql SELECT * FROM data WHERE salary <> 50000

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(1, 'John', 45000), (3, 'Bob', 55000), (4, 'Alice', 60000)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> > greater than<ul>Extract Value if expression are greater than to the condition<br>Filter the Value on Specfic Condition</ul></div>

In [6]:
%sql SELECT * FROM data WHERE salary > 50000

 * mysql+pymysql://root:***@localhost:3307/csv_data
2 rows affected.

[(3, 'Bob', 55000), (4, 'Alice', 60000)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> >= greater than or equal to<ul>Extract Value if expression are greater than or Equal to the condition<br>Filter the Value on Specfic Condition</ul></div>

In [7]:
%sql SELECT * FROM data WHERE salary >= 50000

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(2, 'Jane', 50000), (3, 'Bob', 55000), (4, 'Alice', 60000)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">< Smaller than <ul>Extract Value if expression are smaller than to the condition<br>Filter the Value on Specfic Condition</ul></div>

In [9]:
%sql SELECT * FROM data WHERE salary < 50000

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(1, 'John', 45000)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">< Smaller than or equal to <ul>Extract Value if expression are smaller than or equal to the condition<br>Filter the Value on Specfic Condition</ul></div>

In [10]:
%sql SELECT * FROM data WHERE salary <= 50000

 * mysql+pymysql://root:***@localhost:3307/csv_data
2 rows affected.

[(1, 'John', 45000), (2, 'Jane', 50000)]

<hr>
<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Logical Operators </h1>


<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">logical operators are used to combine multiple conditions in the WHERE clause of a query.
</div>

In [13]:
%%sql 
SELECT * FROM lg

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('John', 'Doe', 35, 'London'),
 ('Jane', 'Smith', 40, 'New York'),
 ('Bob', 'Johnson', 45, 'London'),
 ('Alice', 'Brown', 46, 'Paris'),
 ('Charlie', 'Wilson', 30, 'London')]


<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">ALL <ul>The term "ALL" in SQL is used in combination with comparison operators to compare a value to all values returned by a subquery.<br>It returns TRUE if the comparison is true for all values in the subquery result, and FALSE otherwise.</ul>
</div>

In [14]:
%sql SELECT * FROM lg WHERE age > ALL (SELECT age FROM lg WHERE location = 'London');

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('Alice', 'Brown', 46, 'Paris')]


<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><ul>london location age 30,35,45 <br>total age 30,35,45,40,46
    <ol>30 > of all london age (30,35,45) False</ol>
    <ol>35 > of all london age (30,35,45) False</ol>
    <ol>45 > of all london age (30,35,45) False</ol>
    <ol>40 > of all london age (30,35,45) False</ol>
    <ol>46 > of all london age (30,35,45) True</ol>
    <ol>So paris age (46) is greater than of all (30,35,45) london age</ol>
    <ol>So 46 age condition are satisfied</ol>
</ul>
    ALL means if all of ages must be greater than whole condition True
</div>

<br><br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">ANY / SOME<ul>The ANY operator in SQL is used to compare a value to any value in a set of values.<br>It is often used in combination with a subquery that returns multiple values.<br>The ANY operator returns TRUE if the comparison is true for at least one value in the set, and FALSE otherwise.</ul>SOME Same as ANY
</div>

In [16]:
%sql SELECT * FROM lg WHERE age > ANY (SELECT age FROM lg WHERE location = 'London');

 * mysql+pymysql://root:***@localhost:3307/csv_data
4 rows affected.

[('John', 'Doe', 35, 'London'),
 ('Jane', 'Smith', 40, 'New York'),
 ('Bob', 'Johnson', 45, 'London'),
 ('Alice', 'Brown', 46, 'Paris')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><ul>london location age 30,35,45 <br>total age 30,35,45,40,46
    <ol>30 > of all london age (30,35,45) All 30,35,45 are False</ol>
    <ol>35 > of all london age (30,35,45) True</ol>
    <ol>45 > of all london age (30,35,45) True</ol>
    <ol>40 > of all london age (30,35,45) True</ol>
    <ol>46 > of all london age (30,35,45) True</ol>
    <ol> SO John,Jane,Bob,Alice age greater than of any conditions of (35,45)</ol>
    <ol>So 46 age condition are satisfied</ol>
</ul>
    Any means if Any of ages must be greater whole condition True
</div>

In [17]:
# SOME SAME AS ANY
%sql SELECT * FROM lg WHERE age > SOME (SELECT age FROM lg WHERE location = 'London');

 * mysql+pymysql://root:***@localhost:3307/csv_data
4 rows affected.

[('John', 'Doe', 35, 'London'),
 ('Jane', 'Smith', 40, 'New York'),
 ('Bob', 'Johnson', 45, 'London'),
 ('Alice', 'Brown', 46, 'Paris')]


<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">AND <ul>The AND operator is a logical operator in SQL that combines two or more conditions in a WHERE clause.<br>It returns true if all the conditions separated by AND are true; otherwise, it returns false.</ul>
</div>

In [18]:
%sql SELECT * FROM lg WHERE age > 40 AND age < 46

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('Bob', 'Johnson', 45, 'London')]


<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">BETWEEN <ul>The BETWEEN operator in SQL is used to filter the result set based on a specified range of values.<br>It is typically used in the WHERE clause of a SQL query.</ul>
</div>

In [19]:
%sql SELECT * FROM lg WHERE age BETWEEN 40 AND 46

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[('Jane', 'Smith', 40, 'New York'),
 ('Bob', 'Johnson', 45, 'London'),
 ('Alice', 'Brown', 46, 'Paris')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">OR <ul>The OR operator in SQL is a logical operator that is used to combine multiple conditions in a WHERE clause.<br>It returns true if at least one of the conditions separated by OR is true.<br>In other words, if any of the specified conditions is true, the OR operator returns true for that row.</ul>
</div>

In [20]:
%sql SELECT * FROM lg WHERE age = 46 OR location != 'London'

 * mysql+pymysql://root:***@localhost:3307/csv_data
2 rows affected.

[('Jane', 'Smith', 40, 'New York'), ('Alice', 'Brown', 46, 'Paris')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">IN <ul>The IN operator in SQL is used to specify multiple values in a WHERE clause.<br>It is particularly useful when you want to filter the result set based on whether a column's value matches any value in a specified list.</ul>
</div>

In [21]:
%sql SELECT * FROM lg WHERE age IN (46,45)

 * mysql+pymysql://root:***@localhost:3307/csv_data
2 rows affected.

[('Bob', 'Johnson', 45, 'London'), ('Alice', 'Brown', 46, 'Paris')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">NOT IN <ul>The NOT IN operator in SQL is used to filter the result set based on the absence of values in a specified list..<br>It is essentially the negation of the IN operator.<br>The NOT IN operator returns rows where the specified column's value does not match any value in the provided list.</ul>
</div>

In [22]:
%sql SELECT * FROM lg WHERE age NOT IN (46,45)

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[('John', 'Doe', 35, 'London'),
 ('Jane', 'Smith', 40, 'New York'),
 ('Charlie', 'Wilson', 30, 'London')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">IS NULL <ul>In SQL, the IS NULL condition is used to check if a specified column or expression has a NULL value.<br>It is often used in the WHERE clause of a SELECT statement to filter rows based on the presence of NULL values in a particular column.</ul>
</div>

In [23]:
%sql SELECT * FROM lg WHERE age IS NULL
# null value not exits in data

 * mysql+pymysql://root:***@localhost:3307/csv_data
0 rows affected.

[]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">IS NOT NULL <ul>In SQL, the IS NOT NULL condition is used to check if a specified column or expression does not have a NULL value.<br>It is often used in the WHERE clause of a SELECT statement to filter rows based on the absence of NULL values in a particular column.</ul>
</div>

In [25]:
%sql SELECT * FROM lg WHERE age IS NOT NULL

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('John', 'Doe', 35, 'London'),
 ('Jane', 'Smith', 40, 'New York'),
 ('Bob', 'Johnson', 45, 'London'),
 ('Alice', 'Brown', 46, 'Paris'),
 ('Charlie', 'Wilson', 30, 'London')]


<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">EXISTS <ul>In SQL, the EXISTS operator is used in a subquery to test whether the subquery returns any rows.<br>The EXISTS condition is often used in conjunction with a correlated subquery, where the result of the subquery depends on the values of the outer query.</ul>
</div>

In [26]:
%%sql
SELECT *
FROM lg
WHERE EXISTS (
    SELECT *
    FROM lg AS sub
    WHERE sub.location = 'London'
    AND sub.age < 40
    AND sub.firstname = lg.firstname
);

 * mysql+pymysql://root:***@localhost:3307/csv_data
2 rows affected.

[('John', 'Doe', 35, 'London'), ('Charlie', 'Wilson', 30, 'London')]


<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">NOT EXISTS <ul> it is the alternative for Exists if the recond not Exit in subquery than show the record of upper query</ul>
</div>

In [25]:
%%sql
SELECT *
FROM lg
WHERE NOT EXISTS (
    SELECT *
    FROM lg AS sub
    WHERE sub.location = 'London'
    AND sub.age < 40
    AND sub.firstname = lg.firstname
);

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[('Jane', 'Smith', 40, 'New York'),
 ('Bob', 'Johnson', 45, 'London'),
 ('Alice', 'Brown', 46, 'Paris')]